{
  "lpml.schemas.desc": "Associate schemas to LPML files in the current project.",
  "lpml.schemas.url.desc": "A URL or absolute file path to a schema. Can be a relative path (starting with './') in workspace and workspace folder settings.",
  "lpml.schemas.fileMatch.desc": "An array of file patterns to match against when resolving LPML files to schemas. `*` and '**' can be used as a wildcard. Exclusion patterns can also be defined and start with '!'. A file matches when there is at least one matching pattern and the last matching pattern is not an exclusion pattern.",
  "lpml.schemas.fileMatch.item.desc": "A file pattern that can contain '*' and '**' to match against when resolving LPML files to schemas. When beginning with '!', it defines an exclusion pattern.",
  "lpml.schemas.schema.desc": "The schema definition for the given URL. The schema only needs to be provided to avoid accesses to the schema URL.",
  "lpml.format.enable.desc": "Enable/disable default LPML formatter",
  "lpml.format.keepLines.desc": "Keep all existing new lines when formatting.",
  "lpml.format.trailingCommas.desc": "Controls whether trailing commas are added when formatting.",
  "lpml.format.keyQuotes.desc": "Controls which quotes are used for object keys when formatting.",
  "lpml.format.stringQuotes.desc": "Controls which quotes are used for strings other than keys when formatting.",
  "lpml.format.tabSize.desc": "Overrides the number of spaces used for indentation when formatting. Can be a number or boolean value `true` to use tab character. When unset or set to `false`, the editor's tab size is used.",
  "lpml.format.startIgnoreDirective.desc": "The start of ignore directive for formatting. Default to `lpml-fmt: off`. Only works for `//` line comments.",
  "lpml.format.endIgnoreDirective.desc": "The end of ignore directive for formatting. Default to `lpml-fmt: on`. Only works for `//` line comments.",
  "lpml.validate.enable.desc": "Enable/disable LPML validation.",
  "lpml.tracing.desc": "Traces the communication between VS Code and the LPML language server.",
  "lpml.decorateAllColors.desc": "Try to decorate all colors in LPML files instead of schema-specified colors.",
  "lpml.schemaResolutionErrorMessage": "Unable to resolve schema.",
  "lpml.clickToRetry": "Click to retry.",
  "lpml.maxItemsComputed.desc": "The maximum number of outline symbols and folding regions computed (limited for performance reasons).",
  "lpml.maxItemsExceededInformation.desc": "Show notification when exceeding the maximum number of outline symbols and folding regions.",
  "lpml.enableSchemaDownload.desc": "When enabled, JSON schemas can be fetched from http and https locations.",
  "lpml.command.clearCache": "Clear Schema Cache",
  "lpml.command.sort": "Sort Document"
}
